In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("student_database02.db") #creating new database or connects to the database if it already exists.

In [3]:
cur=db.cursor()

In [4]:
cur.execute("create table student(id int primary key, name text, marks int)")

OperationalError: table student already exists

In [5]:
cur.execute("insert into student(id,name,marks) values(1,'John',90)")

In [6]:
results=cur.execute("select * from student") #  '*'selects all columns

for row in results:
    print(row)

(1, 'John', 90)

In [7]:
cur.execute("insert into student(id,name,marks) values(2,'Teena',100)")

In [8]:
cur.execute("insert into student(id,name,marks) values(3,'Andrew',70)")

In [9]:
cur.execute("insert into student(id,name,marks) values(4,'Dorsey',56)")

In [10]:
cur.execute("insert into student(id,name,marks) values(5,'David',45)")

In [11]:
cur.execute("insert into student(id,name,marks) values(6,'Kim',70)")

In [12]:
cur.execute("insert into student values(7,'Gim',71)")

In [13]:
cur.execute("insert into student values(8,'Jack',94)")

In [15]:
db.commit

In [24]:
results=cur.execute("select * from student") # '*' selects all the columns

for row in results:
    print(row)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Gim', 71)
(8, 'Jack', 94)

# Accessing data stored in SQL lite using python

In [25]:
results=cur.execute('Select id,name from student') #Selecting only two columns id and name
for i in results:
    print(i)

(1, 'John')
(2, 'Teena')
(3, 'Andrew')
(4, 'Dorsey')
(5, 'David')
(6, 'Kim')
(7, 'Gim')
(8, 'Jack')

In [31]:
results=cur.execute('Select * from student where id=1') #Taking out only one row.
for i in results:
    print(i)

(1, 'John', 90)

In [32]:
results=cur.execute('Select * from student where id=2') #Taking out only one row.
for i in results:
    print(i)

(2, 'Teena', 100)

In [36]:
results=cur.execute('Select * from student limit 3') #Show the 3 upper data
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)

In [40]:
results=cur.execute("Select * from student where name='John'")  #search a row with a data present in the row
for i in results:
    print(i)
#Here we can get multiple rows as output if there are more rows with name='John'

(1, 'John', 90)

In [41]:
results=cur.execute("Select * from student where marks>60") #show all rows with marks>60
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)
(7, 'Gim', 71)
(8, 'Jack', 94)

In [ ]:
results=cur.execute("Select * from student where marks>60 and marks<90") #show all rows with marks>60 and marks<90
for i in results:
    print(i)
#both the conditions needs to be true when 'and' statement is present

In [42]:
results=cur.execute("Select * from student where marks>40 and marks<60") #show all rows with marks>60 and marks<90
for i in results:
    print(i)
#both the conditions needs to be true when 'and' statement is present

(4, 'Dorsey', 56)
(5, 'David', 45)

In [43]:
#fetchall will display all rows
results=cur.execute('Select * from student') #selecting all columns present
results.fetchall()

[(1, 'John', 90),
 (2, 'Teena', 100),
 (3, 'Andrew', 70),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (6, 'Kim', 70),
 (7, 'Gim', 71),
 (8, 'Jack', 94)]

In [44]:
#Show all rows with names in acsending order
results=cur.execute("Select * from student order by name asc")
for i in results:
    print(i)

(3, 'Andrew', 70)
(5, 'David', 45)
(4, 'Dorsey', 56)
(7, 'Gim', 71)
(8, 'Jack', 94)
(1, 'John', 90)
(6, 'Kim', 70)
(2, 'Teena', 100)

In [47]:
#Show all rows with names in descending order
results=cur.execute("Select * from student order by name desc")
results.fetchall()

[(2, 'Teena', 100),
 (6, 'Kim', 70),
 (1, 'John', 90),
 (8, 'Jack', 94),
 (7, 'Gim', 71),
 (4, 'Dorsey', 56),
 (5, 'David', 45),
 (3, 'Andrew', 70)]

AND operator

In 'AND' operation both the statements should be true.

In [48]:
resluts=cur.execute("Select * from student where name='David' and marks=45")
resluts.fetchall()

[(5, 'David', 45)]

In [50]:
resluts=cur.execute("Select * from student where id=2 and marks=45")
resluts.fetchall()

#since both conditions are not true, it is showing a vacant list.

[]

OR operator

Only one condition needs to be true

In [51]:
resluts=cur.execute("Select * from student where id=2 or marks=45")
resluts.fetchall()

[(2, 'Teena', 100), (5, 'David', 45)]

In [52]:
resluts=cur.execute("Select * from student where id=4 or marks=56")
resluts.fetchall()

[(4, 'Dorsey', 56)]

In [54]:
resluts=cur.execute("Select * from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(6, 'Kim', 70)

In [ ]:
MIN-- find minimum
MAX-- find maximum
AVG-- find average
SUM-- find sum
COUNT-- count the number of rows

In [55]:
#Find out the minimum marks using this command.
results=cur.execute('select min(marks) from student')

for i in results:
    print(i)

(45,)

In [59]:
#The find out the rows of the students who got minimum marks
results=cur.execute('select * from student where marks=45')
results.fetchone()

(5, 'David', 45)

In [ ]:
# .fetchone can be used instead of .fetchall when we know that we will get only one row as output

In [60]:
#Find out the maximum marks using this command
results=cur.execute('select max(marks) from student')

for i in results:
    print(i)

(100,)

In [61]:
#The find out the rows of the students who got maximum marks
results=cur.execute('select * from student where marks=100')
results.fetchone()

(2, 'Teena', 100)

In [62]:
#between operator
results=cur.execute("select * from student where marks between 65 and 85")
results.fetchall()

[(3, 'Andrew', 70), (6, 'Kim', 70), (7, 'Gim', 71)]

In [63]:
#Show a row with null data
results=cur.execute("select * from student where marks is null")
for i in results:
    print(i)

In [64]:
#Show the rows which donot contain null data.
results=cur.execute("select * from student where marks is not null")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Gim', 71)
(8, 'Jack', 94)

LIKE operator

In [65]:
#Show the data of persons where name starts with 'D'
results=cur.execute('select * from student where name like "D%"') 
for i in results:
    print(i)

(4, 'Dorsey', 56)
(5, 'David', 45)

In [66]:
results=cur.execute('select * from student where name like "J%"') 
for i in results:
    print(i)

(1, 'John', 90)
(8, 'Jack', 94)

In [67]:
#Show the data where the second character in name is 'a'
results=cur.execute('select * from student where name like "_a%"')
for i in results:
    print(i)

(5, 'David', 45)
(8, 'Jack', 94)

In [68]:
#show the data where the name ends with 'm'
results=cur.execute('select * from student where name like "%m"')
for i in results:
    print(i)

(6, 'Kim', 70)
(7, 'Gim', 71)

In [69]:
#show the data where the name contains 'e'
results=cur.execute("select * from student where name like '%e%'")
for i in results:
    print(i)

(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)

In [70]:
#display only 4 letter names
results=cur.execute("select * from student where name like '____'")#four time underscore
for i in results:
    print(i)

(1, 'John', 90)
(8, 'Jack', 94)

In [76]:
#show the rows where marks is not 70
results=cur.execute("select * from student where marks NOT in (70)")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(4, 'Dorsey', 56)
(5, 'David', 45)
(7, 'Gim', 71)
(8, 'Jack', 94)

In [77]:
#show the rows where name is not Kim
results=cur.execute("select * from student where marks NOT in ('Kim')")
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Teena', 100)
(3, 'Andrew', 70)
(4, 'Dorsey', 56)
(5, 'David', 45)
(6, 'Kim', 70)
(7, 'Gim', 71)
(8, 'Jack', 94)